export const harksList = ['str', 'dex', 'wis', 'int', 'con'] as const;

export type Hark = typeof harksList[number];

export type HarksLvl = Record<Hark, number>;

export const harksData: Record<Hark, {
  name: string;
  descr: string;
}> = {
  str: {
    name: 'Сила',
    descr: '● *40%* влияет на вероятность пробоя \n● Увеличивает физический урон',
  },
  dex: {
    name: 'Ловкость',
    descr: '● *90%* влияет на вероятность пробоя \n● *40%* влияет на вероятность защиты \n● *60%* влияет на востановление энергии',
  },
  wis: {
    name: 'Мудрость',
    descr: '● *60%* влияет на успешности магии \n● *60%* на вероятность защиты от магии \n● *60%* влияет на лечение \n● Увеличивает количество маны',
  },
  int: {
    name: 'Интелект',
    descr: '● *40%* влияет на успешность магии \n● *40%* на вероятность защиты от магии \n● *40%* влияет на лечение \n● Увеличивает длительность заклинаний',
  },
  con: {
    name: 'Телосложение',
    descr: '● *60%* влияет на вероятность защиты \n● *40%* влияет на востановление энергии \n● Увеличивает запас здоровья',
  },
};
